<template>
   <v-app>
     <v-app-bar  title="Medicallink" :elevation="2." rounded></v-app-bar>
     <v-main>
       <v-container>
         <v-row>
           <v-col cols="12" >
             <h2>Аннотация</h2>
             <div>
               Medicallink - это технологический проект нацеленный на создание децентрализованной системы хранения и обмена медицинскими данными пациентов медицинских организаций. Бумажные носители (так называемые медицинские карты) не являются надежным методом хранения данных пациентов(общих сведений, историй болезней, медицинских анализов). Поэтому необходимо внедрение новых технологий позволяющих сегментировать и хранить данные беспрецедентным образом. Система Medicallink основана на блокчейне, т.е. вся информация хранится именно в нем(это позволяет хранить данные децентрализовано, приватно и в то же время открыто, в виде общедоступных транзакций)
             </div>
             <h2>Проблема</h2>
             <div>
               В современной инфраструктуре здравохранения отсутствуют надлежащие
               механизмы обмена медицинской информацией. В большинстве случаев
               пациент должен самостоятельно принести все свои прошлые медицинские
               записи в новую больницу или снова сдать медицинские анализы. Кроме
               очевидного неудобства, отсутствие истории болезни пациента можетпривести к неправильному лечению. Другой проблемой является
               отсутствие исчерпывающей информации о пациенте и его истории
               болезни. Неполные данные пациентов могут храниться в базах данных
               различных больниц. Обилие бумажных записей чревато потерей некоторых
               медицинских записей. В результате пациент может получить неправильное лечение.
             </div>
             <h2>Цель работы</h2>
             <div>
               Создание децентрализованной системы хранения и обмена информации о
               любом пациенте и любой ситуации для области здравоохранения.
               Развертование тестовой блокчейн сети. Написание программного
               обеспечения серверной части ноды, клиентского приложения.
             </div>
              <h2>Актуальность</h2>
              <div>
                Система может быть использована в любой области здравоохранения.
                Например, в больницах, поликлиниках, аптеках, лабораториях, в
                страховых компаниях, для хранения и передачи информации.
              </div>
             <h2>Что такое блокчейн?</h2>
              <div>
                Блокчейн - это распределенная база данных, которая хранит
                информацию в блоках. Блоки хранятся в цепочке, которая называется
                цепочкой блоков. Блоки хранятся в блокчейне. Блоки связаны хеш суммой предыдущего блока.
              </div>
             <v-img
               :aspect-ratio="aspectRatio"
               :width="width"
               src="./src/assets/block.jpg"
               cover
             ></v-img>
             <h2>Сравнение web2 и web3</h2>
             <v-img
               :aspect-ratio="aspectRatio"
               :width="width"
               src="./src/assets/web3.png"
               cover
             ></v-img>
              <div>
                <table>
                  <tr>
                    <th>Web2</th>
                    <th>Web3</th>
                  </tr>
                  <tr>
                    <td>Централизованная</td>
                    <td>Децентрализованная</td>
                  </tr>
                  <tr>
                    <td>Центральный сервер</td>
                    <td>Распределенная сеть</td>
                  </tr>
                  <tr>
                    <td>Центральный сервер хранит данные</td>
                    <td>Все участники сети хранят данные</td>
                  </tr>
                  <tr>
                    <td>Центральный сервер контролирует данные</td>
                    <td>Все участники сети контролируют данные</td>
                  </tr>
                  <tr>
                    <td>Центральный сервер контролирует доступ к данным</td>
                    <td>Все участники сети контролируют доступ к данным</td>
                  </tr>
                  </table>
                  </div>
                <h2>Блокчейн в сфере медицины</h2>
             <div>
               Эта технология предлагает новые подходы к моделям
               хранения и управления данных, применяемым сегодня
               во многих приложениях здравоохранения. Это связано
               со способностью блокчейна сегментировать и защищать
               информацию, а также обмениваться медицинскими данными
               и услугами беспрецедентным образом.
             </div>
             <div class="m">
               <v-row>
                 <v-col cols="2">
                   <v-img
                     :aspect-ratio="aspectRatio"
                     :width="width"
                     src="./src/assets/emc.png"
                     cover
                   ></v-img>
                   <v-text >электронные медицинские карты</v-text>
                 </v-col>
                 <v-col cols="2">
                   <v-img
                     :aspect-ratio="aspectRatio"
                     :width="width"
                     src="./src/assets/med2.png"
                     cover
                   ></v-img>
                   <v-text >Цепочки поставок и борьба с контрафактом</v-text>
                 </v-col>
                 <v-col cols="2">
                   <v-img
                     :aspect-ratio="aspectRatio"
                     :width="width"
                     src="./src/assets/med3.png"
                     cover
                   ></v-img>
                    <v-text >Клинические и биомедицинские исследования</v-text>
                 </v-col>
                 <v-col cols="2">
                   <v-img
                     :aspect-ratio="aspectRatio"
                     :width="width"
                     src="./src/assets/med4.png"
                     cover
                   ></v-img>
                   <v-text>Удаленный мониторинг пациента</v-text>
                 </v-col>
                 <v-col cols="2">
                   <v-img
                     :aspect-ratio="aspectRatio"
                     :width="width"
                     src="./src/assets/med5.png"
                     cover
                   ></v-img>
                   <v-text>Распределение донорских органов</v-text>
                 </v-col>
                 </v-row>
             </div>
              <h2>Электронные медицинские карты с использование блокчейна</h2>
              <ul>
                <li><h3>Управляемые пациентом медицинские записи.</h3>
                  Пациент владеет своими медицинскими данными и контролирует доступ к ним. Это устраняет все препятствия для получения
                  пациентами копий своих медицинских записей или передачи их другому поставщику медицинских услуг.</li>
                <li><h3>Неизменяемые записи пациентов</h3>
                  Блокчейн может гарантировать, что медицинские данные не смогут быть изменены кем-либо, в том числе врачами и самими
                  пациентами.
                </li>
                <li><h3>Происхождение данных</h3>
                  Медицинские записи подписаны источником данных. Это позволяет проверять достоверность записей и отклонять ложные
                  записи.
                </li>
                <li><h3>Надежность и доступность данных</h3>
                  Поскольку записи о пациентах хранятся в децентрализованной сети, данные более устойчивы к утрате и хакерским атакам.
                </li>
                <li><h3>Конфиденциальность</h3>
                  Электронные медицинские карты зашифрованы в блокчейне, доступ к ним может быть получен только с использованием
                  закрытым ключом пациента. Даже если в сеть проникнет злоумышленник, расшифровать данные будет невозможно или
                  затруднительно.
                </li>
              </ul>
              <h2>Задачи</h2>
              <div>
                <ul>
                  <li>  Разработка архитектуры системы</li>
                  <li>  Разработка протокола обмена информацией</li>
                  <li>  Разработка клиентского приложения</li>
                  <li>  Разработка серверной части ноды</li>
                  <li>  Развертование тестовой блокчейн сети</li>
                </ul>
              </div>
              <h2>План работы</h2>
              <div>
                <ul>
                  <li>  Развертка блокчейн платформы</li>
                  <li>  Разработка клиентского приложения</li>
                  <li>  Разработка серверной части ноды</li>
                  <li>  Развертование тестовой блокчейн сети</li>
                  <li>  Обработка данных</li>
                  <li>  Тестирование</li>
                </ul>
              </div>
              <h2>Ожидаемые результаты</h2>
              <div>
                В результате мы должны получить: сеть из
                нескольких нод , которые будут записывать
                изменения и считывать информацию, т.е.
                непосредственно работать с блокчейном,
                клиентское ПО, с помощью которого будет
                происходить вся коммуникация между
                пользователем и платформой, серверное
                ПО, обрабатывающее запросы от клиентов и взаимодействующее с блокчейном.
              </div>

           </v-col>
         </v-row>
       </v-container>
     </v-main>
   </v-app>

</template>

<script setup>

</script>
